NorthernMechatronics/ArduinoCore-nm180100/variants/nm180100evb/PeripheralPins.c
#include "am_mcu_apollo.h"

#include "PinNames.h"
#include "PeripheralPins.h"
#include "PeripheralNames.h"

const PinMap PinMap_UART_TX[] =
{
    { GPIO01, UART_0, AM_HAL_PIN_1_UART0TX },
    { GPIO07, UART_0, AM_HAL_PIN_7_UART0TX },
    { GPIO16, UART_0, AM_HAL_PIN_16_UART0TX },
    { GPIO22, UART_0, AM_HAL_PIN_22_UART0TX },
    { GPIO26, UART_0, AM_HAL_PIN_26_UART0TX },
    { GPIO28, UART_0, AM_HAL_PIN_28_UART0TX },
    { GPIO30, UART_0, AM_HAL_PIN_30_UART0TX },
    { GPIO22, UART_0, AM_HAL_PIN_41_UART0TX },
    { GPIO22, UART_0, AM_HAL_PIN_48_UART0TX },

    { GPIO08, UART_1, AM_HAL_PIN_8_UART1TX },
    { GPIO12, UART_1, AM_HAL_PIN_12_UART1TX },
    { GPIO14, UART_1, AM_HAL_PIN_14_UART1TX },
    { GPIO18, UART_1, AM_HAL_PIN_18_UART1TX },
    { GPIO24, UART_1, AM_HAL_PIN_24_UART1TX },
    { GPIO35, UART_1, AM_HAL_PIN_35_UART1TX },
    { GPIO37, UART_1, AM_HAL_PIN_37_UART1TX },
    { GPIO46, UART_1, AM_HAL_PIN_46_UART1TX },
};

const PinMap PinMap_UART_RX[] =
{
//  FIXME: resolve multiple returns in pinmap_find_peripheral
//    { GPIO02, UART_0, AM_HAL_PIN_2_UART0RX },
    { GPIO11, UART_0, AM_HAL_PIN_11_UART0RX },
    { GPIO17, UART_0, AM_HAL_PIN_17_UART0RX },
    { GPIO23, UART_0, AM_HAL_PIN_23_UART0RX },
    { GPIO29, UART_0, AM_HAL_PIN_29_UART0RX },
    { GPIO31, UART_0, AM_HAL_PIN_31_UART0RX },
    { GPIO34, UART_0, AM_HAL_PIN_34_UART0RX },
    { GPIO45, UART_0, AM_HAL_PIN_45_UART0RX },
    { GPIO49, UART_0, AM_HAL_PIN_49_UART0RX },

    { GPIO02, UART_1, AM_HAL_PIN_2_UART1RX },
    { GPIO04, UART_1, AM_HAL_PIN_4_UART1RX },
    { GPIO09, UART_1, AM_HAL_PIN_9_UART1RX },
    { GPIO13, UART_1, AM_HAL_PIN_13_UART1RX },
    { GPIO15, UART_1, AM_HAL_PIN_15_UART1RX },
    { GPIO25, UART_1, AM_HAL_PIN_25_UART1RX },
};

const PinMap PinMap_SPI_MOSI[] =
{
};

const PinMap PinMap_SPI_MISO[] =
{
};

const PinMap PinMap_SPI_SCLK[] =
{
};

const PinMap PinMap_SPI_SSEL[] =
{
};

const PinMap PinMap_I2C_SDA[] =
{
};

const PinMap PinMap_I2C_SCL[] =
{
};

const PinMap PinMap_ADC[] =
{
    { GPIO16, AM_HAL_ADC_SLOT_CHSEL_SE0, AM_HAL_PIN_16_ADCSE0 },
    { GPIO29, AM_HAL_ADC_SLOT_CHSEL_SE1, AM_HAL_PIN_29_ADCSE1 },
    { GPIO11, AM_HAL_ADC_SLOT_CHSEL_SE2, AM_HAL_PIN_11_ADCSE2 },
    { GPIO31, AM_HAL_ADC_SLOT_CHSEL_SE3, AM_HAL_PIN_31_ADCSE3 },
    { GPIO32, AM_HAL_ADC_SLOT_CHSEL_SE4, AM_HAL_PIN_32_ADCSE4 },
    { GPIO33, AM_HAL_ADC_SLOT_CHSEL_SE5, AM_HAL_PIN_33_ADCSE5 },
    { GPIO34, AM_HAL_ADC_SLOT_CHSEL_SE6, AM_HAL_PIN_34_ADCSE6 },
    { GPIO35, AM_HAL_ADC_SLOT_CHSEL_SE7, AM_HAL_PIN_35_ADCSE7 },
    { GPIO13, AM_HAL_ADC_SLOT_CHSEL_SE8, AM_HAL_PIN_13_ADCD0PSE8 },
    { GPIO12, AM_HAL_ADC_SLOT_CHSEL_SE8, AM_HAL_PIN_12_ADCD0NSE9 },
};
